    
label prolog_sb:

    show black
    with dissolve

    $ renpy.pause(.5)
    $ persistent.sprite_time = "night"

    scene bg classroom sb
    with dissolve

    teacher_sb "…Таким образом, теорию корыстности межличностных отношений можно полностью доказать, опираясь лишь на…"
    thinks_adv_sb "На что опираясь – я не дослушал. {w}Очень уж нудная лекция. "
    thinks_nvl_sb "Но если немного порассуждать - бред полный. {w}Человеческие отношения просто невозможно описать одной лишь теорией, тут практики длинною в жизнь бывает мало, чтобы все осознать."
    thinks_nvl_sb "Мне ясны стремления дать людям некую базу по выходу в социум, но такие сведения не должны нести какого-либо окраса."
    thinks_nvl_sb "Тонкости людской психологии - штука забавная, как ни посмотри. {w}Одни пытаются распределить все по книжным полочкам, дать всему и всем номер, природу происхождения, и прочие статистические сведения. {w}Другие же, будто на зло первым - устраивают тут и там сущий хаос и, между прочим, не считают это критичной проблемой."
    thinks_nvl_sb "Но то детали, заключающиеся в характере отдельно взятой личности…"
    thinks_adv_sb"Из моральных дебат меня вывел дребезжащий ржавым колокольчиком звонок."
    nvl clear

    dima_sb "Ох, наконец-то последняя пара закончилась. {w}Теперь можно и домой. "
    "Голова слегка прояснилась, но поводов для мигрени отнюдь не поубавилось. {w}Скоро начинаются зачеты, экзамены, а в финале этого грандиозного представления вишней на торте станет сессия.{w}А я, так уж вышло, человек решительно предпочитающий встречать новый год дома. {w}Перспектива поселиться в учительской права называться перспективой не имеет."
    "К такому выводу пришили я и я."
    friend_sb "Пошли быстрее, а то в гардеробе не протолкнемся. "
    "Окликнул меня мой сосед по парте."
    dima_sb "Да, конечно, побежали быстрее. "

    show black
    with dissolve

    $ renpy.pause(.5)

    hide black 
    with dissolve

    scene bg city street sb
    with dissolve

    thinks_nvl_sb "Еле-еле осиливши, без преувеличений, наверное, стометровую очередь, гардероб признал нас достойными и пропустил в хранилище несметных богатств зимней Сибири. {w}Путь к выходу оказался в разы и гораздо проще - тут уж без происшествий обошлось."
    thinks_nvl_sb "На улице было холодно. {w}И темнело. {w}Тут и там закатное солнце, пробивая стекла панельных высоток, слепило иллюзорными отражениями. {w}Если бы вне люди – можно было бы подумать, что ты попал в пост-апокалипсис. {w}Пастельные солнечные цвета, бетонные джунгли и ни одной живой души в радиусе целой солнечной системы…"
    thinks_nvl_sb "Стоило лишь открыть парадную дверь здания – нос мигом заледенел, а ресницы были в очереди следующими. {w}Мороз словно сделал апперкот прямо по носу, а после еще и подсечку в виде обросших за зиму льдом ступеней."
    thinks_nvl_sb "Но, право сказать, все вышеуказанные погодные неприятности вылились не только на меня и лестницу. {w}Поток машин, льющийся в обыкновении своем по левой стороне, лился не больно уж и активно. {w}Сегодня дорога более походила на неподвижные и умеренные плеяды, нежели на бурную речку из железа и людей внутри. {w}Уловив неуловимый шарм этого зрелища, я вновь пустился в раздумья."
    nvl clear

    show black 
    with dissolve

    $ renpy.pause(.3)

    show cg city highway sb
    with dissolve

    $ renpy.pause(.5)

    show black 
    with dissolve

    $ renpy.pause(.3)

    scene bg bus stop sb
    with dissolve

    thinks_nvl_sb "Четыре экзамена и в каждом минимум пятьдесят вопросов учить, это плохо, а до экзамена всего неделя… {w}С этим надо что-то делать."

    "Почти сразу же к остановке подъехал автобус. {w}Набитый как банка из под, непосредственно, селёдки. {w}Пополнив количество содержимого банки на колесах еще одной очередной порцией туш, водитель тронулся далее по маршруту."

    scene bg bus window sb
    with dissolve

    thinks_nvl_sb "В теории, если учить по тридцать вопросов в течение дня, то все пройдет без сучка без задоринки. {w}Но то лишь идеал. {w}Запоминать такое количество информации без дальнейшего применения - что вилами по воде. {w}Просто необходимо что-то делать. "
    "…"
    nvl clear

    thinks_nvl_sb "Если же учить не все две сотни вопросов, а, скажем, сто сорок. {w}Это уменьшает общее количество но шестьдесят, что дает два лишних дня относительно прошлого подхода. {w}И сверх того, жертвуется лишь пятнадцать вопросов каждого экзамена, что в свою очередь означает, что шанс наткнутся на невыученный вопрос составляет лишь двадцать пять процентов. {w}Многовато, да."
    thinks_nvl_sb "Но кто не рискует, тот учит все, верно? {w}Зато лишние два дня дают возможность лучше усвоить материал оставшихся вопросов." 
    thinks_nvl_sb "Также можно отсеять вопросы, на которые можно ответить импровизируя. {w}Эх, лишь бы не погореть!"
    nvl clear
    friend_sb "Твоя остановка. "
    "Вывел меня из раздумий друг."
    dima_sb "Блин чуть не пропустил. "

    scene bg none sb
    with dissolve

    "Распрощавшись с другом, я вылез из автобуса, иного слова не подобрать, попутно находясь в легком послевкусии прошедшего уже транса. {w}Было стойкое ощущение неизбежного и нового буквально за горизонтом, а от того – абсолютно пусто в голове. {w}Пару раз перейдя дорогу, поскользнувшись раза три, и даже упав, я добрался таки до дома."
    "Лифт быстро поднял меня на седьмой этаже обычной многоэтажной панельки. {w}Мне она нравилась, высокая, зеленая, стройная… Но мертвецки неживая. {w}Моя дверь – справа от лифта. {w}Звучно брякнув в замке ключом я открыл дверь, а та – с легким скрипом отварилась."

    scene bg outdoor sb 
    with dissolve

    dima_sb "Надо бы смазать, пожалуй…"

    show black
    with dissolve

    scene bg room sb 
    with dissolve

    "Кинув рюкзак под стол, переодевшись и умывшись, я сел за подготовку в экзаменам."
    "…"
    "…"
    "…"
    dima_sb "Ну-с, пожалуй начнем-с. "
    "…"

    play sound stomach_rumbling_sb

    "Сначала придётся покушать."

    scene bg kitchen sb 
    with dissolve

    "Дошлёпав босыми ногами по кафелю кухни до холодильника и открыв его…"
    "Так-с, что у нас в холодильнике имеется?"
    dima_sb "Хм-м-м."
    "А ничего и не имеется."
    dima_sb "Грустно как-то, в магазин придётся идти. "

    show black
    with dissolve

    scene bg room sb 
    with dissolve

    thinks_nvl_sb "Наспех взяв рюкзак из-под стола и закинув в него кошелек, паспорт и телефон с наушниками."
    thinks_nvl_sb "Перекинув пальто через правое плечо, я окинул взором весь периметр комнаты. "
    thinks_nvl_sb "Взгляд уцепился за перочинный ножик, полёживающий на тумбочке."
    nvl clear

    dima_sb "Береженного, как говориться…"
    "…"

    #door closing sound
    show bg outdoor sb 
    with dissolve

    $ renpy.pause(.5)

    scene bg city street sb
    with dissolve

    thinks_nvl_sb "Улица вновь встретила холодным ударом с правой, подгоняя ко всему прочему ледяным ветром в спину. "
    thinks_nvl_sb "Пробираясь по дорожкам рысцой и стараясь не навернуться от греха подальше на импровизированным катке, организованным, непосредственно и естественно морозной зимой и бездействием местного управления, я вдруг решил определиться со списком покупок немного заранее, нежели обыкновенно."
    nvl clear
    "…"
    thinks_nvl_sb "Бюджет имел неплохую такую пробоину в корпусе лодки, а потому ассортимент сильно ограничился. {w}Безусловно, на базовые продукты типа хлеба, молока, колбасы да чуть овощей хватало. Ко всему прочему, после недолгих и крайне томных раздумий было решено прихватить пачку пельменей."
    nvl clear
    dima_sb "Вполне себе…"
    play sound zvuk_smerti_sb
    dima_sb "АЙ, БЛ…"
    "В один миг обернув мою рассеяность и невнимательность против меня самого, зима распластала меня навзничь по тротуару улицы. {w}Если без лишних красок эпитетов - я сделал я невероятное сальто, и упал на снег."
    dima_sb "У-а-а-а-а, холодно, больно, что за день такой."
    "Быстренько встав, отряхнувшись и оглянувшись вокруг на предмет свидетеля (последних, к слову, не было обнаружено), я отправился дальше. Но впредь осторожнее."
    
    #store bg
    
    thinks_nvl_sb "Еле-еле достигнув ближайшего продуктового, наконец получилось вздохнуть с облегчением."
    thinks_nvl_sb "Вход павильона магазина плюнул в лицо горстью теплого воздуха, от чего кожа словно полыхнула."
    thinks_nvl_sb "Протиснувшись сквозь приличную толпу у входа в магазин, кхм, так скажем, пользующийся особой популярностью именно по пятничным вечерам, я попал в торговый зал четверочки."
    thinks_nvl_sb "К слову: все магазины находятся под одной крышей общего павильона, но торговые залы открыты и находятся друг напротив друга. {w}Потому очереди с касс, при правильном расположении последних, спокойно направлялись прямо в общий импровизированный холл."
    nvl clear
    "Взяв корзинку и положив в нее шапку я быстрым шагом направился по различным разделам магазина в поисках необходимых и заранее определенных продуктов."
    #игра
    "Взяв с полки последний товар из списка и дойдя до кассы, я обнаружил еще одну пробоину в судна \"бюджет\". {w}А именно его отсутствие до ближайшей зарплаты. "
    "Кошелек пропал."
    dima_sb "Ну дела… И где его искать…"
    "Бабка в очереди позади уже готова была просверлить меня взглядом насквозь, а кассир пепелил мутным сонным взглядом так, будто бы смотрит не на человека, потерявшего кошелек, а на… {w}Ну, вы поняли."
    "Договорившись с последним о том, что я схожу за платежными средствами, я покинул магазин, а затем и павильон. {w}Ощущение пирровой победы не исчезало, а связано оно было со временем, затраченным на споры с представителем магазина. "
    "Ну, это все подождет."
    "Оперативно собравшись с мыслями, я начал прокручивать в голове все события, что могли привести к утере кошелька."
    "Из дома брал? {w}Брал. {w}Точно помню, брал. {w}Ключ от дома в почтовый ящик не клал. "
    "Значит, не там."
    "…"
    "Сняв рюкзак и осмотрев как изнутри, так и снаружи, кошелек я не обнаружил. {w}Но обнаружил кое-что, что могло к нему привести. {w}Карман, в котором он лежал, был открыт. {w}Украли? Нет, вряд-ли. {w}Я бы заметил. {w}И тут-то все стало на свои места. "
    "Карман я не закрыл еще по выходу из дома, а кошелек остался на месте неудачного приземления в снег."
    "Столь же оперативно вернувшись на место кульбита (благо, оно в шаговой доступности от павильона), я увидел… {w}Снег. {w}Снег, снег, снег. {w}Еще снег. {w}Место падения не располагало пропавшим бумажником."
    dima_sb "Черт! "
    "Грузно взглянув на уже темнеющее небо, я громко выдохнул. "
    "По чисто случайности в тот момент, когда я уже опускал голову обратно, на, примерно, середине дороги я увидел темный силуэтик человека. {w}Он вальяжно раскинулся на скамье, и робко посматривал в мою сторону."
    dima_sb "А вдруг…"
    "Подойдя к скамье, фонарь выдал в силуэте сидевшего девушку. {w}Девушку лет восемнадцати-семнадцати. "
    "Маленькую, и с причудливым цветом глаз - оливковым. {w}Редко такой цвет встречается. {w}Интересно, сколько процентов населения Земли имеет такой же цвет… "
    "Нужно узнать. {w}Но это все позже."
    "Переведя дыхание, я негромко поздоровался."
    dima_sb "Извините, а Вы, случаем, не находили во-о-о-он там кошелек в снегу? {w}Я ткнул примерно в то место, где последний был утерян."
    "Девушка же, ехидно улыбнувшись (улыбка ее мне кого-то напоминала, не то кота, не то старого знакомого, не то обоих сразу), ответ дала положительный."
    girl_sb "А, Вы про этот?"
    "Она показала мне искомый предмет, повертев его в руках."
    girl_sb "Нашла как раз там, куда Вы, собственно указали, да."
    "…"
    "Немного промедлив она спросила."
    girl_sb "А он точно Ваш? "
    "Тут я слегка пришел в ступор, так как никаких идентификационных или опознавательных знаков в бумажнике не было."
    dima_sb "Ну, могу карты перечислить…"
    girl_sb "Ладно-ладно, верю."
    "Сказала она, рассмеявшись вновь чутка кошачьей улыбкой."
    dima_sb "Буквально полчаса назад проходил здесь и обронил, спасибо Вам большое! "
    "Желанный предмет уже оказался у меня в руках, но девушка не спешила отдавать."
    girl_sb "И правда, похоже, Ваш кошелёк. "
    girl_sb "Но!"
    "Сверкнув в очередной раз дикой улыбкой, она выдала то, чего ну от слова совсем ожидать не стоило. {w}Ага, конечно."
    girl_sb "Я требую вознаграждение за найденный предмет. "
    "И вновь ее улыбка затмила мое чувство такта. {w}Да так, что после этого я собственной слюной подавился."
    dima_sb "Я надеюсь, это шутка?"
    "С некой крупицей надежды и толикой непонимания вопрошаю я. {w}Но девушка словно и вовсе не слышала сказанного, даже напротив. {w}Напротив, отреагировала так, будто бы я согласился на такой эдакий подвиг."
    girl_sb "Что же, от кофе не откажусь. "
    "Ласково протянула девушка. {w}И вновь уже в свой, дескать, кошачей манере."
    dima_sb "Нет, не поймите меня не правильно, я весьма и очень Вам благодарен, но с деньгами сейчас худо. {w}Даже, можно сказать, плачевно."
    girl_sb "Хм-м-мм, как же нам тогда поступить?.."
    "Честное слово, ощущение, будто на экзамене находишься, предварительно не приготовившись должным образом. {w}И вот-вот завалит же преподаватель, с трудом на вопросы отвечаешь, и боишься каждого слова - чем дальше в лес…"
    "Выбирая из двух зол меньшее, меньшим будет угостить ее чашкой кофе. {w}Мало-ли что ей в голову стукнет. {w}А применять к девушке силу как-то не оно. {w}Неправильно."
    dima_sb "Так-с, ладно. {w}Тут недалеко кафе есть. {w}Сочтемся на чашке кофе?"
    girl_sb "Так бы сразу! Пошли!"
    "Она молнией подлетела ко мне, от чего сугубо рефлекторно я попятился назад. "
    "Больно уж она открытая. {w}И с наглецой, куда уж без этого."
    "И секундой позднее девушка уже была на пути (кстати говоря, верном) к месту назначения."
    "…"
    "Немного отойдя от раздумий, последовали очередные. "
    "…Как ее зовут-то? Вроде бы мы не представлялись…"
    girl_sb "А, кстати, меня Юлей звать."
    "Проговорила девушка, встав прямо передо мной, от чего мы чуть не повалились на снег."
    dima_sb "Очень приятно, Юлия?"
    girl_sb "К чему все эти формальности? Просто Юля."
    "И к тому же не очень вежливая. {w}Но это прослеживалось с самого начала."
    "Кинув взгляд в сторону новой знакомой, я поймал ее выжидающий взор."
    "…А, точно! Тьфу ты."
    "А меня Дима звать."
    uvao_sb "Рада знакомству! "
    "Уголки ее рта разъехались в улыбке, таинственной улыбке. "
    "…"
    "На пути к кафе Юля еще что-то рассказывала, но, честно говоря, я ее не слушал."
    "Гораздо важнее было сейчас наверстать упущенное время подготовки. {w}А это целый вечер."
    "…"
    "Благо, кафе находилось буквально в паре сотен метров от места, так сказать, встречи. {w}Думать пришлось недолго."
    "Расположившись за столиком у окна (теперь уже более смахивающим на зеркало), я заказал две чашки кофе. {w}Бариста, верно, приняв нас за пару, предложил к кофе пару пончиков, на что Юля охотно согласилась."
    "…Наглость - второе счастье…"
    "Умяв оба лакомства, Юля задумчиво уставилась в ночь за окном."
    uvao_sb "А ты, наверное, каждые выходные сюда дам водишь?"
    dima_sb "Ага, конечно."
    "О таком исходе событий и думать не приходилось - все свободное время за обе щеки уплетала учеба и сопутствующие ей различные мероприятия. {w}Да и не сказать, что желание менять партнерш каждую дюжину дней имелось."
    uvao_sb "Но настоящая причина-то в другом, да? "
    "От такого вопроса я слегка выпал в осадок. {w}Более чем уверен, что ничего не проронил во время раздумий…"
    dima_sb "Причина чего?"
    "На что девушка в ответ лишь улыбнулась. {w}Но теперь, теперь в ее улыбке играли более, человечные что-ли, нотки. {w}Нежели хитрые, острые и кошачьи."
    "Казалось, что вот-вот что-то случится… {w}Но нет, ничего такого. {w}Движение веком вниз, затем вверх - будто вместе с ним и смыло лишь показавшуюся на мгновение крупицу человечности."
    "Показалось, наверное…"
    uvao_sb "Понятно-понятно."
    "Заключила девушка. {w}А что, собственно понятно - решительно непонятно."
    uvao_sb "Ну, расскажешь, что случилось?"
    "Не знаю, что на меня нашло. {w}То ли эффект попутчика, то ещё чего заумного, но мне вдруг захотелось ей все выложить без прикрас, как оно есть."
    "И что учиться уже невмоготу, и как последний дорогой мне человек отвернулся в трудный момент, и что бессонница мучает, и как отец с матерью ссорились, и как он потом ушел из семьи… {w}Накипело всякого в общем. {w}Безусловно, было много и положительных моментов, но по весу добро явно уступало злу, если так можно выразиться."
    "Но совесть не была согласна с таким решением, дескать, кто не рискует - тот не пьет. {w}А я как раз не пью."
    "…"
    "Выйдя из дебрей раздумий Я обнаружил, что Юля до сих пор вопросительно на меня смотрит."
    dima_sb "Да что тут рассказать, не сошлись характерами…"
    "Даже не успел я договорить, как был перебит."
    uvao_sb "И теперь ты считаешь, что завести какие-либо отношения - большая проблема? {w}Ясненько-ясненько."
    "Она словно как с книги прочитала последующие мои слова, что так и не были произнесены."
    uvao_sb "Ну, то дело весьма поправимое…"
    "…"
    uvao_sb "Ладно, поздно уже. {w}Ты же проводишь даму до дома?"
    "Вновь вернув свой кошачий акцент проговорила, а вернее промурчала девушка. {w}А я же решил не хвататься за краткий наш диалог. {w}Но возвращаясь к вопросу…"
    "…Еще чего не хватало… {w}Хотя, быть честным - прогуляться сейчас отнюдь не последнее мое желание. {w}Так что в принципе…"
    "Юля же тем временем скорчила грустную мордашку и почти была готова расплакаться."
    dima_sb "Ладно-ладно, пошли, не надо представлений."
    "Девушка моментально и сию же секунду переменилась в лице."
    uvao_sb "Ура!"
    "Не думаю, что она рассчитывала на то, что я это услышу. "
    "…"
    "Сказано - сделано! {w}Решено было пойти пешком. {w}Прогулки на свежем воздухе еще никому не вредили, верно?"
    "Да и тем более, поехав мы на автобусе - как знать, что бы Юля могла там учудить. {w}Так надежнее, что-ли. {w}Как то ни странно, но путь оказался достаточно спокойным - ни вездесущего льда на тропах, ни проходящих мимо людей, ни слов…"
    "Лишь высокие коряги ламп освещали путь двум темным силуэтам. {w}Прошло около получаса, как вдруг Юля резко обернулась ко мне и со словами:"
    uvao_sb "Спасибо, что проводил. {w}Дальше я сама. {w}Тут неподалеку есть остановка. {w}Во-о-он там."
    "Она ткнула пальцем в сторону одного из многоквартирных и многоэтажных домов. "
    uvao_sb "Ну-с, мне пора."
    "Она не оборачиваясь более зашагала в сторону одного из подъездов. {w}Но на миг мне показалось, что ветер шепнул ее голосом:"
    uvao_sb "Не упусти возможности…"
    "…"
    "Я стоял в ступоре приблизительно недолгое время. "
    dima_sb "Какую возможность? Куда упустить…"
    "История покрывалась тучами. "
    "…"
    "Еле отыскав ту самую остановку, о которой было говорено, на удивление почти сразу приехал нужный автобус."
    dima_sb "Повезло, право. {w}Еще и в такой час."
    "Взойдя на борт транспортного средства, я почувствовал, как тепло обволакивает буквально все вокруг. {w}В отличие от улицы - где властвует холод и тьма."
    "Ехать было недалеко, но за день я настолько вымотался, что аж в сон клонить начало."
    show blinking with dissolve
    "Нас учат считать математические пределы, строить системы, в которых все компоненты одинаково идеальны, учат выражать отношение через пропорцию. {w}Но никто не учит тому, что придется учиться любить, понимать, принимать… "
    "Придется шагать по выбранному пути в одиночку, а выбирать нужно с осторожностью и проницательностью."
    "Придётся учиться слушать и слышать. {w}Не учат, что в один день все может пойти отнюдь не так, как хотелось бы, не так, как надо… {w}И точно также не учат что делать, когда не понимаешь сам себя, когда теряешься в тайфуне мыслей, буре эмоций и океане недосказанности…"
    "Никто никогда не скажет, как лучше, ведь как лучше не знает никто. {w}Никто…"
